app/controllers/v1/registrations_controller.rb

    def create
      user = User.new(user_params)
      if user.save!
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "gender") VALUES ($1, $2, $3, $4, $5) RETURNING "id"