app/controllers/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "ivan@mail.com"], ["LIMIT", 1]]
---
    def create
      user = User.find_by(email: params[:email])